app/admin/seats.rb

  scope -> {"비공개"}, :unused

	batch_action :used do |ids|
		@seats = Seat.where(id: ids)

		@seats.each do |seat|
			seat.update(seat_use: true)
		end
		flash[:notice] = "자리 예매가 가능합니다."
		redirect_back(fallback_location: root_path)
	end

	batch_action :unused do |ids|
		@seats = Seat.where(id: ids)

		@seats.each do |seat|
			seat.update(seat_use: false)
---
SELECT "seats".* FROM "seats" WHERE "seats"."id" = $1  [["id", 1]]
UPDATE "seats" SET "seat_use" = $1, "updated_at" = $2 WHERE "seats"."id" = $3  [["seat_use", true], ["updated_at", "2022-11-18 05:54:41.028061"], ["id", 1]]
UPDATE "seats" SET "seat_use" = $1, "updated_at" = $2 WHERE "seats"."id" = $3  [["seat_use", false], ["updated_at", "2022-11-18 05:55:46.832974"], ["id", 1]]