app/controllers/megabox_controller.rb

	def movie
		@movies = Movie.all
---
SELECT "movies".* FROM "movies"

	def ticket
		@movies = Movie.all
		@theaters = Theater.all
		@screens = Screen.all
---
SELECT "movies"."id" FROM "movies"
SELECT "theaters".* FROM "theaters"
SELECT "screens"."id" FROM "screens"