app/controllers/screens_controller.rb

SELECT "movies".* FROM "movies"
SELECT "theaters".* FROM "theaters"
---
	def index
		@movies = Movie.all
		@theaters = Theater.all