app/controllers/ticketings_controller.rb

	def create
		@price = params[:tk_price]
		Ticketing.create(
			screen_id: 1,
			user_id: current_user.id,
			tk_account: params[:adult].to_i,
			tk_price: @price.to_i * params[:adult].to_i
			)
---
INSERT INTO "ticketings" ("tk_account", "tk_price", "created_at", "updated_at", "user_id", "screen_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"